// Repet_Lexa.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// N кошек нашли K мышек и решили разделить их поровну. Определите, сколько мышек останется после того, как все кошки возьмут себе равное количество мышек.
#include <iostream>

int main()
{
   /* int N, K, a;
    std::cin >> N >> K; //1
    std::cout << K / N;
    
    std::cin >> N >> K; //2
    std::cout << K % N;
    
    std::cin >> a;
    std::cout << a % 10; //3
    
    std::cin >> a;
    std::cout << a / 10; //4 
   
    
    std::cin >> N;
    std::cout << (N % 100) / 10; //(5)
    
    std::cin >> N;
    std::cout << (N / 100) + ((N / 10)%10) + (N % 10); (6) 
   
    
    std::cin >> N;
    std::cout << N + 2 - N % 2; (7)
     
    std::cin >> N;
    std::cout << (N / 3600) << ":" << ((N % 3600) / 60) << ":" << ((N % 3600) % 60)%60; (8) */
    
    int N;


    
    




}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
